report.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-18 水 08:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>確率統計2022 レポートについて</title>
<meta name="author" content="suzuki@iwate-u.ac.jp" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">確率統計2022 レポートについて</h1>

<div id="outline-container-org7ed2712" class="outline-2">
<h2 id="org7ed2712">1回目のレポート</h2>
<div class="outline-text-2" id="text-org7ed2712">
</div>
<div id="outline-container-orgc47af81" class="outline-3">
<h3 id="orgc47af81">提出</h3>
<div class="outline-text-3" id="text-orgc47af81">
<ul class="org-ul">
<li>〆切: 2022.06.01</li>
<li>提出場所: Webclass</li>
</ul>
</div>
</div>

<div id="outline-container-org1beca4d" class="outline-3">
<h3 id="org1beca4d">問題</h3>
<div class="outline-text-3" id="text-org1beca4d">
<p>
<a href="http://whitewell.sakura.ne.jp/R/Rprobability.html">Rで確率を学ぶ</a> (白井) の演習問題より
</p>
</div>

<div id="outline-container-org0c00ead" class="outline-4">
<h4 id="org0c00ead">演習問題1-3:</h4>
<div class="outline-text-4" id="text-org0c00ead">
<p>
事象AとBに対し、次の式が成り立つことを示せ:
</p>

<p>
\( P(B | A) = P(B) P(A|B) / P(A) \)
</p>
</div>
</div>

<div id="outline-container-org5693fc8" class="outline-4">
<h4 id="org5693fc8">演習問題1-4:</h4>
<div class="outline-text-4" id="text-org5693fc8">
<p>
形状も重さも同じである赤球と白玉がそれぞれ50個ずつある箱から目をつぶっ
て一個取り出してそれが赤球である確率はいくらか。
</p>

<p>
次に、赤球を10個だけ入れた箱を3箱、赤球10個と白球10個を入れた箱を1箱、
赤球10個と白球40個を入れた箱を1箱、合計5箱用意したとする。 そして、ま
ず目をつぶって箱を選び、そこから目をつぶって玉を一個取り出し、それが赤
球であった場合の確率を求めよ。
</p>

<p>
そして、 先の操作での答と値が違うことを確認せよ。 最初の操作と次の操作
では共に赤球と白玉は50個ずつであったが、どうして2回の操作で確率が異な
るのか、説明せよ。
</p>
</div>
</div>

<div id="outline-container-org8cff3c0" class="outline-4">
<h4 id="org8cff3c0">習問題2-1</h4>
<div class="outline-text-4" id="text-org8cff3c0">
<p>
ある病気に罹患しているかどうか検査において、「（ある人が）陽性反応が出
る」という事象をAとし、「（その人が）実際に罹患しえいる」という事象をE
とする。 そして、確率が次のように与えられているとする:
</p>

<p>
\( P(A|E) = 0.56\), \( P(A|E^{c} ) = 0.04\), \(P(E)=0.035\).
</p>

<p>
この時、検査で陽性反応である確率と、陽性反
応が出た時に実際に病気を発病する確率をそれぞれ求めよ。
</p>
</div>
</div>


<div id="outline-container-orgd957990" class="outline-4">
<h4 id="orgd957990">演習問題2-2</h4>
<div class="outline-text-4" id="text-orgd957990">
<p>
とある適性検査で、（ある人が）適性と判定される事象をTとし、（その人が）
実際に適性があるという事象をEとする。
</p>

<p>
\( P(E)=0.60\), \( P(T|E)=0.80 \), \( P(T|E^{c})=0.040 \)のとき、
</p>

<p>
ある人が適性と判定され、かつ実際に適性である事象の確率を求めよ。
</p>
</div>
</div>

<div id="outline-container-org833f8c0" class="outline-4">
<h4 id="org833f8c0">演習問題2-3</h4>
<div class="outline-text-4" id="text-org833f8c0">
<p>
三種類の物体(仮にA,B,C とする) の認識ができるカメラ機構を備えているロ
ボットがある。
</p>

<p>
ロボットは、
</p>
<ul class="org-ul">
<li>Aの物体を認識した場合には赤色のLEDを、</li>
<li>Bの物体を認識した場合は緑色のLED を、</li>
<li>C の物体を認識したら青のLED を点滅させる。</li>
<li>ロボットのカメラ機構は故障することがあり、故障した場合も
ロボットは赤色のLEDを点滅させる。</li>
<li>そして故障する事前確率はp = 0.01 である。</li>
</ul>

<p>
ここで3 種類の物体の中からN 個をランダムに選び、次々にロボットに
提示した。すると、すべてロボットは赤色のLED を点滅させた。
</p>

<p>
N = 1 から N=10 の場合に対し、ロボットのカメラ機構が
壊れている確率を求めよ。
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp</p>
<p class="date">Created: 2022-05-18 水 08:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
